import 'package:assets_audio_player/assets_audio_player.dart';
import 'package:cahf/modules.dart';

final audios = <Audio>[
  Audio(
    'assets/songs/1.mp3',
    metas: Metas(
      extra: {
        "word": """

""",
      },

      id: '1',
      title: 'سورة الكهف',
      artist: 'اضغط هنا للرجوع',
      album: AppStrings().appName,
      // image: MetasImage.network('https://www.google.com')
      // image: MetasImage.asset('assets/images/ch.jpg'),
    ),
  ),
//   Audio(
//     'assets/songs/2.mp3',
//     metas: Metas(
//       extra: {
//         "word": """
//
// """,
//       },
//       id: '2',
//       title: 'سورة محمد',
//       artist: 'اضغط هنا للرجوع',
//       album: AppStrings().appName,
//     ),
//   ),
//   Audio(
//     'assets/songs/3.mp3',
//     metas: Metas(
//       extra: {
//         "word": """
//
// """,
//       },
//       id: '3',
//       title: 'سورة الفتح',
//       artist: 'اضغط هنا للرجوع',
//       album: AppStrings().appName,
//     ),
//   ),
//   Audio(
//     'assets/songs/4.mp3',
//     metas: Metas(
//       extra: {
//         "word": """
//
// """,
//       },
//       id: '4',
//       title: 'سورة الحجرات',
//       artist: 'اضغط هنا للرجوع',
//       album: AppStrings().appName,
//     ),
//   ),
//   Audio(
//     'assets/songs/5.mp3',
//     metas: Metas(
//       extra: {
//         "word": """
// """,
//       },
//       id: '5',
//       title: 'سورة ق',
//       artist: 'اضغط هنا للرجوع',
//       album: AppStrings().appName,
//     ),
//   ),
//   Audio(
//     'assets/songs/6.mp3',
//     metas: Metas(
//       extra: {
//         "word": """
// """,
//       },
//       id: '6',
//       title: 'سورة الواقعة',
//       artist: 'اضغط هنا للرجوع',
//       album: AppStrings().appName,
//     ),
//   ),
//   Audio(
//     'assets/songs/7.mp3',
//     metas: Metas(
//       extra: {
//         "word": """
//
// """,
//       },
//       id: '7',
//       title: 'سورة الحديد',
//       artist: 'اضغط هنا للرجوع',
//       album: AppStrings().appName,
//     ),
//   ),
//   Audio(
//     'assets/songs/8.mp3',
//     metas: Metas(
//       extra: {
//         "word": """
//         بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ
// وَٱلطُّورِ (1) وَكِتَٰبٖ مَّسۡطُورٖ (2) فِي رَقّٖ مَّنشُورٖ (3) وَٱلۡبَيۡتِ ٱلۡمَعۡمُورِ (4) وَٱلسَّقۡفِ ٱلۡمَرۡفُوعِ (5) وَٱلۡبَحۡرِ ٱلۡمَسۡجُورِ (6) إِنَّ عَذَابَ رَبِّكَ لَوَٰقِعٞ (7) مَّا لَهُۥ مِن دَافِعٖ (8) يَوۡمَ تَمُورُ ٱلسَّمَآءُ مَوۡرٗا (9) وَتَسِيرُ ٱلۡجِبَالُ سَيۡرٗا (10) فَوَيۡلٞ يَوۡمَئِذٖ لِّلۡمُكَذِّبِينَ (11) ٱلَّذِينَ هُمۡ فِي خَوۡضٖ يَلۡعَبُونَ (12) يَوۡمَ يُدَعُّونَ إِلَىٰ نَارِ جَهَنَّمَ دَعًّا (13) هَٰذِهِ ٱلنَّارُ ٱلَّتِي كُنتُم بِهَا تُكَذِّبُونَ (14) أَفَسِحۡرٌ هَٰذَآ أَمۡ أَنتُمۡ لَا تُبۡصِرُونَ (15) ٱصۡلَوۡهَا فَٱصۡبِرُوٓاْ أَوۡ لَا تَصۡبِرُواْ سَوَآءٌ عَلَيۡكُمۡۖ إِنَّمَا تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ (16) إِنَّ ٱلۡمُتَّقِينَ فِي جَنَّـٰتٖ وَنَعِيمٖ (17) فَٰكِهِينَ بِمَآ ءَاتَىٰهُمۡ رَبُّهُمۡ وَوَقَىٰهُمۡ رَبُّهُمۡ عَذَابَ ٱلۡجَحِيمِ (18) كُلُواْ وَٱشۡرَبُواْ هَنِيٓـَٔۢا بِمَا كُنتُمۡ تَعۡمَلُونَ (19) مُتَّكِـِٔينَ عَلَىٰ سُرُرٖ مَّصۡفُوفَةٖۖ وَزَوَّجۡنَٰهُم بِحُورٍ عِينٖ (20) وَٱلَّذِينَ ءَامَنُواْ وَٱتَّبَعَتۡهُمۡ ذُرِّيَّتُهُم بِإِيمَٰنٍ أَلۡحَقۡنَا بِهِمۡ ذُرِّيَّتَهُمۡ وَمَآ أَلَتۡنَٰهُم مِّنۡ عَمَلِهِم مِّن شَيۡءٖۚ كُلُّ ٱمۡرِيِٕۢ بِمَا كَسَبَ رَهِينٞ (21) وَأَمۡدَدۡنَٰهُم بِفَٰكِهَةٖ وَلَحۡمٖ مِّمَّا يَشۡتَهُونَ (22) يَتَنَٰزَعُونَ فِيهَا كَأۡسٗا لَّا لَغۡوٞ فِيهَا وَلَا تَأۡثِيمٞ (23) ۞وَيَطُوفُ عَلَيۡهِمۡ غِلۡمَانٞ لَّهُمۡ كَأَنَّهُمۡ لُؤۡلُؤٞ مَّكۡنُونٞ (24) وَأَقۡبَلَ بَعۡضُهُمۡ عَلَىٰ بَعۡضٖ يَتَسَآءَلُونَ (25) قَالُوٓاْ إِنَّا كُنَّا قَبۡلُ فِيٓ أَهۡلِنَا مُشۡفِقِينَ (26) فَمَنَّ ٱللَّهُ عَلَيۡنَا وَوَقَىٰنَا عَذَابَ ٱلسَّمُومِ (27) إِنَّا كُنَّا مِن قَبۡلُ نَدۡعُوهُۖ إِنَّهُۥ هُوَ ٱلۡبَرُّ ٱلرَّحِيمُ (28) فَذَكِّرۡ فَمَآ أَنتَ بِنِعۡمَتِ رَبِّكَ بِكَاهِنٖ وَلَا مَجۡنُونٍ (29) أَمۡ يَقُولُونَ شَاعِرٞ نَّتَرَبَّصُ بِهِۦ رَيۡبَ ٱلۡمَنُونِ (30) قُلۡ تَرَبَّصُواْ فَإِنِّي مَعَكُم مِّنَ ٱلۡمُتَرَبِّصِينَ (31) أَمۡ تَأۡمُرُهُمۡ أَحۡلَٰمُهُم بِهَٰذَآۚ أَمۡ هُمۡ قَوۡمٞ طَاغُونَ (32) أَمۡ يَقُولُونَ تَقَوَّلَهُۥۚ بَل لَّا يُؤۡمِنُونَ (33) فَلۡيَأۡتُواْ بِحَدِيثٖ مِّثۡلِهِۦٓ إِن كَانُواْ صَٰدِ
//         """,
//       },
//       id: '8',
//       title: 'سورة الطلاق',
//       artist: 'اضغط هنا للرجوع',
//       album: AppStrings().appName,
//     ),
//   ),
//   Audio(
//     'assets/songs/9.mp3',
//     metas: Metas(
//       extra: {
//         "word": "",
//       },
//       id: '9',
//       title: 'سورة التحريم',
//       artist: 'اضغط هنا للرجوع',
//       album: AppStrings().appName,
//     ),
//   ),
];
